In [7]:
import pandas as pd
import numpy as np
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}
dict2={'a':5,'b':6,'c':7,'d':8,'e':9}
data={"first":dict1,"second":dict2}
df=pd.DataFrame(data,dtype=np.int32)
df

   first  second
a      1       5
b      2       6
c      3       7
d      4       8
e      5       9

In [6]:
import pandas as pd
import numpy as np
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}
dict1={'a':5,'b':6,'c':7,'d':8,'f':9}
data={"first":dict1,"second":dict2}
df=pd.DataFrame(data)
df

   first  second
a    5.0     5.0
b    6.0     6.0
c    7.0     7.0
d    8.0     8.0
f    9.0     NaN
e    NaN     9.0

In [8]:
d1={"name":["rith","rithwik","chotu"],"address":["hyd","tel","madina"]}
df=pd.DataFrame(d1)
df

      name address
0     rith     hyd
1  rithwik     tel
2    chotu  madina

In [10]:
s1=pd.Series([1,2,3,4,5,6,7,8,9,10])
s2=pd.Series([1.5,2.5,3.5,4.7,5.8,6.8,7.0,.88,9.5,10.3])
s3=pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data={"first":s1,"second":s2,"third":s3}
df=pd.DataFrame(data)
df

   first  second third
0      1    1.50     a
1      2    2.50     b
2      3    3.50     c
3      4    4.70     d
4      5    5.80     e
5      6    6.80     f
6      7    7.00     g
7      8    0.88     h
8      9    9.50     i
9     10   10.30     j

In [11]:
df["second"]

0     1.50
1     2.50
2     3.50
3     4.70
4     5.80
5     6.80
6     7.00
7     0.88
8     9.50
9    10.30
Name: second, dtype: float64

In [12]:
df[["first","second"]]

   first  second
0      1    1.50
1      2    2.50
2      3    3.50
3      4    4.70
4      5    5.80
5      6    6.80
6      7    7.00
7      8    0.88
8      9    9.50
9     10   10.30

In [13]:
df.loc[:,"second"]

0     1.50
1     2.50
2     3.50
3     4.70
4     5.80
5     6.80
6     7.00
7     0.88
8     9.50
9    10.30
Name: second, dtype: float64

In [14]:
df.loc[0:5,"third"]

0    a
1    b
2    c
3    d
4    e
5    f
Name: third, dtype: object

In [16]:
df.loc[0:5,["third","second"]]

  third  second
0     a     1.5
1     b     2.5
2     c     3.5
3     d     4.7
4     e     5.8
5     f     6.8

In [17]:
df.iloc[:,0]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: first, dtype: int64

In [19]:
df.iloc[:,[0,1,2]]

   first  second third
0      1    1.50     a
1      2    2.50     b
2      3    3.50     c
3      4    4.70     d
4      5    5.80     e
5      6    6.80     f
6      7    7.00     g
7      8    0.88     h
8      9    9.50     i
9     10   10.30     j

In [20]:
df.iloc[0:4,0:1]

   first
0      1
1      2
2      3
3      4

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   10 non-null     int64
 1   second  10 non-null     float64
 2   third   10 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 368.0+ bytes

In [22]:
df.shape

(10, 3)

In [24]:
df.columns

Index(['first', 'second', 'third'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [26]:
df.head()

   first  second third
0      1     1.5     a
1      2     2.5     b
2      3     3.5     c
3      4     4.7     d
4      5     5.8     e

In [27]:
df.head(3)

   first  second third
0      1     1.5     a
1      2     2.5     b
2      3     3.5     c

In [28]:
df.tail()

   first  second third
5      6    6.80     f
6      7    7.00     g
7      8    0.88     h
8      9    9.50     i
9     10   10.30     j

In [29]:
df.tail(3)

   first  second third
7      8    0.88     h
8      9    9.50     i
9     10   10.30     j

In [30]:
df.sample()

   first  second third
2      3     3.5     c

In [31]:
df.sample(5)

   first  second third
9     10    10.3     j
0      1     1.5     a
6      7     7.0     g
3      4     4.7     d
8      9     9.5     i

In [32]:
df.describe()

          first    second
count  10.00000  10.00000
mean    5.50000   5.24800
std     3.02765   3.22179
min     1.00000   0.88000
25%     3.25000   2.75000
50%     5.50000   5.25000
75%     7.75000   6.95000
max    10.00000  10.30000